In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
os.getcwd()

'C:\\Users\\JYIN\\Customer_Arrears'

In [3]:
os.chdir('H:\\Desktop')

In [4]:
newdata = pd.read_csv('FINALS.csv')

In [5]:
newdata.describe()

,KY_BA,Account_Age_Mar,Account_Age_Apr,Account_Age_May,usage3,usage4,usage5,chgrt3,chgrt4,chgrt5,SQFT_Code,mo3,mo4,mo5,DD3,DD4,DD5
count,3.058050e+05,305805.000000,305805.000000,305805.000000,2.994940e+05,2.956520e+05,2.919640e+05,286513.000000,283269.000000,279479.000000,224177.000000,305805.000000,305805.000000,305805.000000,305805.000000,305805.000000,305805.000000
mean,3.800845e+09,12.478713,12.560905,12.645836,5.496091e+03,4.719918e+03,5.033686e+03,0.099685,0.022867,0.283440,3.308640,634.241398,647.753216,580.922652,0.075970,0.117091,0.132974
std,2.884301e+09,12.821742,12.821742,12.821742,3.667214e+04,3.403834e+04,3.651520e+04,4.303770,9.153242,11.142901,2.027936,2413.989288,2599.144309,2609.423094,0.298748,0.366250,0.418483
min,1.009250e+05,-1.073973,-0.991781,-0.906849,0.000000e+00,0.000000e+00,0.000000e+00,-1.000000,-1.000000,-1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.218927e+09,2.660274,2.742466,2.827397,2.790000e+02,2.120000e+02,2.160000e+02,-0.086989,-0.337696,-0.067961,2.000000,41.020000,39.330000,28.970000,0.000000,0.000000,0.000000
50%,3.252987e+09,8.323288,8.405479,8.490411,8.790000e+02,6.490000e+02,6.750000e+02,0.000000,-0.100000,0.000000,3.000000,154.150000,143.290000,110.560000,0.000000,0.000000,0.000000
75%,6.058781e+09,18.153425,18.235616,18.320548,2.880000e+03,2.309000e+03,2.420250e+03,0.068159,0.000000,0.135379,5.000000,468.910000,457.050000,387.850000,0.000000,0.000000,0.000000
max,9.999962e+09,56.947945,57.030137,57.115068,7.110964e+06,7.285279e+06,7.448491e+06,936.000000,2724.000000,2670.000000,8.000000,206292.020000,252605.630000,519403.770000,3.000000,4.000000,4.000000

In [6]:
newdata.isnull().sum()

KY_BA                   0
Account_Age_Mar         0
Account_Age_Apr         0
Account_Age_May         0
usage3               6311
usage4              10153
usage5              13841
chgrt3              19292
chgrt4              22536
chgrt5              26326
sgmt                    0
CD_OPER_CNTR            0
CD_CREDIT_RATING     9097
FL_EBILL                0
CD_AD_TYPE              0
SQFT_Code           81628
SQFT_Desc           81628
mo3                     0
mo4                     0
mo5                     0
DD3                     0
DD4                     0
DD5                     0
dtype: int64

In [7]:
newdata[['usage3', 'usage4', 'usage5', 'chgrt3', 'chgrt4', 'chgrt5']] = newdata[['usage3', 'usage4', 'usage5', 'chgrt3', 'chgrt4', 'chgrt5']].fillna(0)

In [8]:
newdata.isnull().sum()

KY_BA                   0
Account_Age_Mar         0
Account_Age_Apr         0
Account_Age_May         0
usage3                  0
usage4                  0
usage5                  0
chgrt3                  0
chgrt4                  0
chgrt5                  0
sgmt                    0
CD_OPER_CNTR            0
CD_CREDIT_RATING     9097
FL_EBILL                0
CD_AD_TYPE              0
SQFT_Code           81628
SQFT_Desc           81628
mo3                     0
mo4                     0
mo5                     0
DD3                     0
DD4                     0
DD5                     0
dtype: int64

In [9]:
newdata['CD_CREDIT_RATING'].fillna('Missing', inplace = True)

In [10]:
newdata.isnull().sum()

KY_BA                   0
Account_Age_Mar         0
Account_Age_Apr         0
Account_Age_May         0
usage3                  0
usage4                  0
usage5                  0
chgrt3                  0
chgrt4                  0
chgrt5                  0
sgmt                    0
CD_OPER_CNTR            0
CD_CREDIT_RATING        0
FL_EBILL                0
CD_AD_TYPE              0
SQFT_Code           81628
SQFT_Desc           81628
mo3                     0
mo4                     0
mo5                     0
DD3                     0
DD4                     0
DD5                     0
dtype: int64

In [11]:
set(list(newdata['CD_CREDIT_RATING']))

{'A', 'B', 'C', 'D', 'Missing'}

In [12]:
import matplotlib.pyplot as plt

In [13]:
df = newdata.groupby(by = 'sgmt', as_index = False).agg({'KY_BA': pd.Series.nunique})

In [16]:
sgmt_list = list(set(newdata['sgmt']))

In [18]:
# sort list  
# essential for grouping 
sgmt_list.sort() 
sgmt_list

['Agriculture',
 'Amusement',
 'Communications',
 'Construction',
 'Convenience Stores',
 'Data Centers',
 'Education',
 'Government(Military)',
 'Government(Non-Military)',
 'Grocery',
 'Healthcare',
 'Hotels/Lodging',
 'Mfg. Automotive',
 'Mfg. Chemicals',
 'Mfg. Fabricated Metal and Machinery',
 'Mfg. Food & Beverage',
 'Mfg. Forest Products',
 'Mfg. Light Manufacturing',
 'Mfg. Plastics & Rubber',
 'Mfg. Primary Metal',
 'Mfg. Stone, Clay, and Glass',
 'Mfg. Textile & Apparel',
 'Missing',
 'Office/Real Estate',
 'Other',
 'Other Information',
 'Restaurants',
 'Retail/Mercantile',
 'Services',
 'Transportation',
 'Utility-Electricity',
 'Utility-Gas',
 'Utility-Water or Wastewater',
 'Warehouses',
 'Web Service',
 'Wholesale',
 'Worship']

In [53]:
gov_group = sgmt_list[7:9]

In [69]:
newdata['newsgmt1'] = np.where(newdata['sgmt'].isin(gov_group), "Government", newdata['sgmt'])
newdata['newsgmt2'] = np.where(newdata['newsgmt1'].isin(["Other", "Other Information", "Missing"]), "Other", newdata['newsgmt1'])
newdata['newsgmt3'] = np.where(newdata['newsgmt2'].isin(["Utility-Electricity", "Utility-Gas", "Utility-Water or Wastewater"]), "Utility", newdata['newsgmt2'])
newdata['newsgmt4'] = np.where(newdata['newsgmt3'].isin(["Data Centers", "Web Service"]), "Data Center & Web Service", newdata['newsgmt3'])

In [70]:
newdata.groupby(by = 'newsgmt4', as_index = False).agg({'KY_BA': pd.Series.nunique})

                               newsgmt4  KY_BA
0                           Agriculture   3134
1                             Amusement   7104
2                        Communications  21305
3                          Construction  19468
4                    Convenience Stores   1806
5             Data Center & Web Service    186
6                             Education   4918
7                            Government  14380
8                               Grocery   3946
9                            Healthcare  11313
10                       Hotels/Lodging   3323
11                      Mfg. Automotive    584
12                       Mfg. Chemicals    968
13  Mfg. Fabricated Metal and Machinery   1770
14                 Mfg. Food & Beverage   1963
15                 Mfg. Forest Products   1559
16             Mfg. Light Manufacturing  11965
17               Mfg. Plastics & Rubber    330
18                   Mfg. Primary Metal   1597
19          Mfg. Stone, Clay, and Glass    716
20               Mfg. Textile & Apparel    590
21                   Office/Real Estate  68731
22                                Other  16951
23                          Restaurants  14875
24                    Retail/Mercantile  32324
25                             Services  23398
26                       Transportation   4216
27                              Utility   4449
28                           Warehouses   4596
29                            Wholesale   7592
30                              Worship  15748

In [71]:
newdata.head()

,KY_BA,Account_Age_Mar,Account_Age_Apr,Account_Age_May,usage3,usage4,usage5,chgrt3,chgrt4,chgrt5,...,mo5,DD3,DD4,DD5,newsgmt,newsgmt_f,newsgmt1,newsgmt2,newsgmt3,newsgmt4
0,100925,6.846575,6.928767,7.013699,12000.0,10800.0,9000.0,0.111111,-0.100000,-0.166667,...,1698.36,0,0,0,Mfg. Light Manufacturing,Mfg. Light Manufacturing,Mfg. Light Manufacturing,Mfg. Light Manufacturing,Mfg. Light Manufacturing,Mfg. Light Manufacturing
1,101020,1.210959,1.293151,1.378082,167244.0,105544.0,103471.0,-0.078469,-0.368922,-0.019641,...,13385.13,0,0,0,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate
2,101646,2.123288,2.205479,2.290411,168898.0,106447.0,102988.0,-0.047383,-0.369756,-0.032495,...,0.00,0,0,0,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate,Office/Real Estate
3,102401,22.915068,22.997260,23.082192,52489.0,45266.0,59314.0,-0.231651,-0.137610,0.310343,...,0.00,0,0,1,Hotels/Lodging,Hotels/Lodging,Hotels/Lodging,Hotels/Lodging,Hotels/Lodging,Hotels/Lodging
4,102554,16.715068,16.797260,16.882192,61200.0,34500.0,21900.0,-0.055556,-0.436275,-0.365217,...,0.00,0,0,1,Retail/Mercantile,Retail/Mercantile,Retail/Mercantile,Retail/Mercantile,Retail/Mercantile,Retail/Mercantile

In [72]:
newdata.isnull().sum()

KY_BA                   0
Account_Age_Mar         0
Account_Age_Apr         0
Account_Age_May         0
usage3                  0
usage4                  0
usage5                  0
chgrt3                  0
chgrt4                  0
chgrt5                  0
sgmt                    0
CD_OPER_CNTR            0
CD_CREDIT_RATING        0
FL_EBILL                0
CD_AD_TYPE              0
SQFT_Code           81628
SQFT_Desc           81628
mo3                     0
mo4                     0
mo5                     0
DD3                     0
DD4                     0
DD5                     0
newsgmt                 0
newsgmt_f               0
newsgmt1                0
newsgmt2                0
newsgmt3                0
newsgmt4                0
dtype: int64

In [99]:
mode_table = newdata.groupby(['newsgmt4'])['SQFT_Code'].agg(lambda x:x.value_counts().index[0]).to_frame()

In [108]:
mode_table['newsgmt4'] = mode_table.index

In [111]:
mode_table.reset_index(drop=True, inplace=True)
mode_table

    SQFT_Code                             newsgmt4
0         1.0                          Agriculture
1         2.0                            Amusement
2         2.0                       Communications
3         1.0                         Construction
4         2.0                   Convenience Stores
5         3.0            Data Center & Web Service
6         8.0                            Education
7         5.0                           Government
8         1.0                              Grocery
9         3.0                           Healthcare
10        3.0                       Hotels/Lodging
11        2.0                      Mfg. Automotive
12        7.0                       Mfg. Chemicals
13        2.0  Mfg. Fabricated Metal and Machinery
14        2.0                 Mfg. Food & Beverage
15        2.0                 Mfg. Forest Products
16        2.0             Mfg. Light Manufacturing
17        8.0               Mfg. Plastics & Rubber
18        3.0                   Mfg. Primary Metal
19        3.0          Mfg. Stone, Clay, and Glass
20        2.0               Mfg. Textile & Apparel
21        3.0                   Office/Real Estate
22        3.0                                Other
23        2.0                          Restaurants
24        2.0                    Retail/Mercantile
25        1.0                             Services
26        2.0                       Transportation
27        7.0                              Utility
28        2.0                           Warehouses
29        2.0                            Wholesale
30        2.0                              Worship

In [119]:
df_1 = newdata[pd.isnull(newdata.SQFT_Code)]
df_2 = newdata[pd.notnull(newdata.SQFT_Code)]

In [123]:
df_1 = df_1.drop(['SQFT_Code'], axis=1)

In [124]:
df_3 = df_1.join(mode_table.set_index('newsgmt4'), on='newsgmt4', how='left')

In [130]:
df = pd.concat([df_3, df_2], sort=True)